{
  "title": "Privacy Policy for Terapeuta",
  "effectiveDate": "December, 2024",
  "sections": [
    {
      "title": "1. Information We Collect",
      "subsections": [
        {
          "title": "1.1 Personal Information",
          "content": "We may collect personal information that you provide directly when using Terapeuta, including:",
          "list": [
            "Name",
            "Email address",
            "Account credentials (e.g., username and password)",
            "Information related to session bookings (e.g., dates and preferences)"
          ]
        },
        {
          "title": "1.2 Chat Data",
          "content": "When you interact with our AI-powered chatbot, the content of your conversations may be collected and temporarily stored for the following purposes:",
          "list": [
            "Providing responses and improving chatbot functionality.",
            "Enhancing user experience by understanding user needs."
          ]
        },
        {
          "title": "1.3 Usage Data",
          "content": "We may collect non-personal information about how you interact with the platform, such as:",
          "list": [
            "IP address",
            "Browser type and version",
            "Operating system",
            "Pages visited, session duration, and other analytical data"
          ]
        },
        {
          "title": "1.4 Firebase Data",
          "content": "As Terapeuta integrates with Firebase, we may collect data related to authentication, session history, and error reporting. Firebase follows strict security measures and privacy standards."
        }
      ]
    },
    {
      "title": "2. How We Use Your Information",
      "list": [
        "Facilitate account creation and authentication.",
        "Enable secure booking, management, and cancellation of therapy sessions.",
        "Provide therapeutic responses and resources through the AI chatbot.",
        "Continuously improve chatbot accuracy and contextual understanding.",
        "Analyze usage trends to enhance our services.",
        "Debug errors and improve technical performance.",
        "Send booking confirmations, notifications, and updates.",
        "Respond to support requests."
      ]
    },
    {
      "title": "3. How We Protect Your Information",
      "list": [
        "Encryption: All data transmitted between your device and our servers is encrypted using industry-standard protocols (e.g., HTTPS).",
        "Access Controls: Only authorized personnel have access to user data.",
        "Secure Storage: Sensitive data, such as passwords, is encrypted and securely stored.",
        "AI Privacy Measures: Chatbot conversations are anonymized and stored temporarily, solely for improving the service."
      ]
    },
    {
      "title": "4. Sharing Your Information",
      "content": "We do not sell or share your personal information with third parties except as required to provide our services or comply with legal obligations. Specifically:",
      "list": [
        "Service Providers: We may share data with trusted third-party providers (e.g., Firebase) to support platform functionality.",
        "Legal Compliance: We may disclose information if required by law or to protect user safety."
      ]
    },
    {
      "title": "5. Retention of Data",
      "list": [
        "Personal Data: We retain your personal data for as long as your account remains active or as required to fulfill the purposes outlined in this policy.",
        "Chat Data: Conversations with the AI chatbot are temporarily stored and anonymized for quality improvement and are deleted after 30days"
      ]
    },
    {
      "title": "6. Your Rights",
      "content": "As a user of Terapeuta, you have the following rights:",
      "list": [
        "Access: Request access to the personal data we have collected about you.",
        "Correction: Request corrections to inaccurate or incomplete information.",
        "Deletion: Request deletion of your data, subject to legal and contractual obligations.",
        "Opt-Out: Opt-out of data collection related to analytics and non-essential services."
      ]
    },
    {
      "title": "7. AI Chatbot Disclaimer",
      "content": "The AI-powered chatbot is designed to provide general therapeutic advice and resources. It is not a substitute for professional therapy or medical advice. Always consult a licensed therapist or medical professional for personalized support."
    },
    {
      "title": "8. Cookies and Tracking Technologies",
      "content": "We use cookies and similar technologies to:",
      "list": [
        "Enhance user experience.",
        "Track usage analytics for improving the platform."
      ],
      "additionalInfo": "You can control cookie preferences through your browser settings."
    },
    {
      "title": "9. Third-Party Links",
      "content": "Terapeuta may contain links to third-party websites or services. We are not responsible for the privacy practices or content of these external sites. Please review their privacy policies for more information."
    },
    {
      "title": "10. Updates to This Privacy Policy",
      "content": "We may update this Privacy Policy from time to time to reflect changes in legal requirements or our practices. The updated policy will be posted on this page with the effective date."
    },
    {
      "title": "11. Contact Us",
      "content": "If you have any questions or concerns about this Privacy Policy or how your data is handled, please contact us at:",
      "list": [
        "Email: support@terapeuta.com",
        "Address: 1408 Avenue J, Suite 101, Brooklyn, NY"
      ]
    }
  ]
}
